Revit 2018 API
BuiltInFailures.ImageFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.ImageFailures type exposes the following members.
Properties
Name | Description
BadViewType
 Image Instances can't be placed in 3D Views.
See Also
BuiltInFailures.ImageFailures Class
Autodesk.Revit.DB Namespace